Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS60/edc/PIC32CM5164LS60100.PIC
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM114" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057C8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM115" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057CC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM116" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057D0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM117" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057D4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM118" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057D8">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM119" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057DC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM120" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057E0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="TRAM" edc:cname="RAM121" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x420057E4">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TRAM">
            <edc:SFRFieldDef edc:cname="DATA" edc:nzwidth="0x20" edc:desc="Trust RAM Data"/>
            <edc:AdjustPoint edc:offset="-24"/>
            <edc:SFRFieldDef edc:cname="BYTE1" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
            <edc:SFRFieldDef edc:cname="HWORD1" edc:nzwidth="0x10" edc:desc="Trust RAM Halfword Data"/>
            <edc:AdjustPoint edc:offset="-8"/>
            <edc:SFRFieldDef edc:cname="BYTE3" edc:nzwidth="0x8" edc:desc="Trust RAM Data"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
